# from re import A


# print('hello') #함수

# # 변수, 함수, 클래스
# a=1 #변수
# a() #함수 or 메소드
# A # 클래스; 첫글자가 대문자로 시작하면 클래스라고 생각하면 됨 (소문자라고 클래스가 아닌건 아님)


# from random import * # *에 있는 모든 것을 불러와라
# print("hello") #기본이기 때문에 import하지 않아도 사용할 수 있음

# print(100)
# print("문자를 출력할 수 있습니다.")
# print(100+100)
# print(100-50)

# print("100"+"50")
# print('100',50) # ,를 쓰게 되면 서로 타입이 다르더라도 더해줄수 있음

# print((100+5)*2) #사칙연산 순서대로 계산
# print(100+5*2)

print('%d %d' %(5, 10))
print('%d + %d = %d' %(10,5,10+5))
print('-'*20)

# 1*1=1
# 1*2=2
# 1*3=3
# 1*4=4
# 1*5=5

print('%d * %d = %d' %(1,1,1*1))
print('%d * %d = %d' %(1,2,1*2))
print('%d * %d = %d' %(1,3,1*3))
print('%d * %d = %d' %(1,4,1*4))
print('%d * %d = %d' %(1,5,1*5))
print('-'*10)
print(3.41)
print('-'*10)
print('%07d %f' %(3.41, 3.41))